test/data/xml/pelco/GetNode.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:env="http://www.w3.org/2003/05/soap-envelope " 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:xs="http://www.w3.org/2001/XMLSchema" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>admin</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">9CktoumRZS5HXeM4RGxTb+DCPmA=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">FwEb2Hd7rMOo2BHRdW8ARw==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-09T17:15:16.277Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <tptz:GetNode>
      <tptz:NodeToken>PTZID-0</tptz:NodeToken>
    </tptz:GetNode>
  </s:Body>
</s:Envelope>